Versao Corrigida da API - Mobile - Web
Foram corrigidos todos os erros da API, Mobile e Web e implementado como forma de melhoria o modo do usuario poder setar a IA Desejada por ele e o devido token de uso.
